Revit 2026 API

# SiteLocationConvertToProjectTime Method

---

Converts local time or UTC time to project time.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DateTime ConvertToProjectTime(
	DateTime inputTime
)
```
```vb
Public Function ConvertToProjectTime (
	inputTime As DateTime
) As DateTime
```
```cpp
public:
DateTime ConvertToProjectTime(
	DateTime inputTime
)
```
```fsharp
member ConvertToProjectTime :
        inputTime : DateTime -> DateTime
```

#### Parameters

inputTime DateTime
    The input local time or UTC time.

#### Return Value

DateTime

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the inputTime's kind is neither Local nor Utc. |

Daylight savings time is not considered during this conversion.

#### Reference

SiteLocation Class

Autodesk.Revit.DB Namespace